In [2]:
import numpy as np
import pandas as pd

In [6]:
data=pd.read_csv('Bengaluru_House_Data.csv')

In [7]:
data.head()

              area_type   availability  ... balcony   price
0  Super built-up  Area         19-Dec  ...     1.0   39.07
1            Plot  Area  Ready To Move  ...     3.0  120.00
2        Built-up  Area  Ready To Move  ...     3.0   62.00
3  Super built-up  Area  Ready To Move  ...     1.0   95.00
4  Super built-up  Area  Ready To Move  ...     1.0   51.00

[5 rows x 9 columns]

In [9]:
data.shape

(13320, 9)

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [16]:
for column in data.columns:
  print(data[column].value_counts())
  print("*"*20)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
********************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
14-Jul               1
16-Oct               1
16-Nov               1
16-Jul               1
15-Jun               1
Name: availability, Length: 81, dtype: int64
********************
Whitefield                      540
Sarjapur  Road                  399
Electronic City                 302
Kanakpura Road                  273
Thanisandra                     234
                               ...
Sabari Nagar                      1
K G Colony                        1
Bull Temple Road                  1
RK Layout 2nd Stage               1
2nd phase jp nagar, jp nagar      1
Name: location, Length: 1305, dtype: int64
********************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 Bedroom       2
10 BHK           2
11 BHK           2
18 Bedroom       1
27 BHK           1
13 BHK           1
16 BHK           1
19 BHK           1
43 Bedroom       1
14 BHK           1
12 Bedroom       1
Name: size, dtype: int64
********************
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Srncykh     1
Asira E     1
Vadel C     1
SrSaira     1
Asnex A     1
Name: society, Length: 2688, dtype: int64
********************
1200    843
1100    221
1500    205
2400    196
600     180
       ...
2842      1
785       1
2153      1
2970      1
2395      1
Name: total_sqft, Length: 2117, dtype: int64
********************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
18.0       1
40.0       1
15.0       1
14.0       1
Name: bath, dtype: int64
********************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
********************
75.00    310
65.00    302
55.00    275
60.00    270
45.00    240
        ...
81.55      1
69.49      1
42.18      1
70.25      1
74.82      1
Name: price, Length: 1994, dtype: int64
********************

In [17]:
data.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [19]:
data.drop(columns=['area_type','availability','society','balcony'],inplace=True )

In [20]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [22]:
data['location'].value_counts()

Whitefield                      540
Sarjapur  Road                  399
Electronic City                 302
Kanakpura Road                  273
Thanisandra                     234
                               ...
Sabari Nagar                      1
K G Colony                        1
Bull Temple Road                  1
RK Layout 2nd Stage               1
2nd phase jp nagar, jp nagar      1
Name: location, Length: 1305, dtype: int64

In [23]:
data['location']=data['location'].fillna('Sarjapur  Road')

In [24]:
data['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 Bedroom       2
10 BHK           2
11 BHK           2
18 Bedroom       1
27 BHK           1
13 BHK           1
16 BHK           1
19 BHK           1
43 Bedroom       1
14 BHK           1
12 Bedroom       1
Name: size, dtype: int64

In [25]:
data['size']=data['size'].fillna('2BHK')

In [27]:
data['bath']=data['bath'].fillna(data['bath'].median())

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13320 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [29]:
data.isna().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [42]:
data['bhk']=data['size'].str.split().str.get(0)

In [56]:
data['bhk']=data['bhk'].str[:1]

In [57]:
data['bhk'].value_counts()

2    5545
3    4857
4    1418
1     680
5     356
6     221
7     100
8      89
9      54
Name: bhk, dtype: int64

In [58]:
data['bhk']=data['bhk'].astype(int)

In [64]:
data['bhk'].describe()

count    13320.000000
mean         2.779054
std          1.169434
min          1.000000
25%          2.000000
50%          3.000000
75%          3.000000
max          9.000000
Name: bhk, dtype: float64

In [66]:
data['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [70]:
def ConvertRange(x):
  temp=x.split('-')
  if(len(temp)==2):
    return (float(temp[0])+ float(temp[1]))/2
  try:
    return float(x)
  except:
    return None

In [71]:
data['total_sqft']=data['total_sqft'].apply(ConvertRange)

In [72]:
data.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

price per sqft

In [73]:
data['price_per_sqft']=data['price']*100000/data['total_sqft']

In [74]:
data['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [75]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.779054    7.907501e+03
std     1238.405258      1.338754    148.971674      1.169434    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000      9.000000    1.200000e+07

In [78]:
data['location'].value_counts()

Whitefield                      540
Sarjapur  Road                  400
Electronic City                 302
Kanakpura Road                  273
Thanisandra                     234
                               ...
Sabari Nagar                      1
K G Colony                        1
Bull Temple Road                  1
RK Layout 2nd Stage               1
2nd phase jp nagar, jp nagar      1
Name: location, Length: 1305, dtype: int64

In [79]:
data['location']=data['location'].apply(lambda x:x.strip())
location_count=data['location'].value_counts()

In [80]:
location_count_lessthan10=location_count[location_count<=10]

In [81]:
location_count_lessthan10

Nagappa Reddy Layout    10
BTM 1st Stage           10
Naganathapura           10
Basapura                10
Gunjur Palya            10
                        ..
Punappa Layout           1
Kalhalli                 1
Kanakapura Road          1
Gopal Reddy Layout       1
Ashraya Layout           1
Name: location, Length: 1053, dtype: int64

In [82]:
data['location']=data['location'].apply(lambda x: 'other' if x in location_count_lessthan10 else x)

Outlier detection and removal

In [83]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626694      2.688814    112.565627      2.779054    7.907501e+03
std     1238.405258      1.338754    148.971674      1.169434    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000      9.000000    1.200000e+07

In [84]:
(data['total_sqft']/data['bhk']).describe()

count    13274.000000
mean       581.103776
std        427.535606
min          0.250000
25%        475.000000
50%        553.166667
75%        625.500000
max      26136.000000
dtype: float64

In [85]:
data=data[((data['total_sqft']/data['bhk'])>=300)]
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12546.000000  12546.000000  12546.000000  12546.000000    12546.000000
mean    1594.946735      2.573410    111.587875      2.641001     6316.631551
std     1261.888955      1.185164    152.220010      0.947783     4182.436934
min      300.000000      1.000000      8.440000      1.000000      267.829813
25%     1116.000000      2.000000     49.000000      2.000000     4210.526316
50%     1300.000000      2.000000     70.000000      3.000000     5295.950156
75%     1700.000000      3.000000    115.000000      3.000000     6924.391099
max    52272.000000     40.000000   3600.000000      9.000000   176470.588235

In [86]:
data.shape

(12546, 7)

In [87]:
data.price_per_sqft.describe()

count     12546.000000
mean       6316.631551
std        4182.436934
min         267.829813
25%        4210.526316
50%        5295.950156
75%        6924.391099
max      176470.588235
Name: price_per_sqft, dtype: float64

In [89]:
def remove_outlier_sqft(df):
  df_output=pd.DataFrame()
  for key,subdf in df.groupby('location'):
    m=np.mean(subdf.price_per_sqft)

    st=np.std(subdf.price_per_sqft)

    gen_df= subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft>(m-st))]
    df_output=pd.concat([df_output,gen_df],ignore_index=True)
  return df_output
data=remove_outlier_sqft(data)
data.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  11203.000000  11203.000000  11203.000000  11203.000000    11203.000000
mean    1594.227398      2.597429    117.436003      2.655985     6567.191989
std     1008.455519      1.206215    159.225127      0.946157     4322.579427
min      300.000000      1.000000     10.000000      1.000000     1250.000000
25%     1127.000000      2.000000     51.000000      2.000000     4441.372000
50%     1310.000000      2.000000     74.000000      3.000000     5500.000000
75%     1724.000000      3.000000    121.000000      3.000000     7124.589204
max    30400.000000     40.000000   3600.000000      9.000000   176470.588235

In [90]:
def bhk_outlier_remover(df):
  exclude_indices=np.array([])
  for location,location_df in df.groupby('location'):
    bhk_stats={}
    for bhk,bhk_df in location_df.groupby('bhk'):
      bhk_stats[bhk]={
          'mean':np.mean(bhk_df.price_per_sqft),
          'std':np.std(bhk_df.price_per_sqft),
          'count':bhk_df.shape[0]
      }
    for bhk,bhk_df in location_df.groupby('bhk'):
      stats=bhk_stats.get(bhk-1)
      if stats and  stats['count']>5:
         exclude_indices= np.append(exclude_indices,bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
  return df.drop(exclude_indices,axis='index')

In [91]:
data=bhk_outlier_remover(data)

In [92]:
data.shape

(7566, 7)

In [93]:
data.drop(columns=['size','price_per_sqft'],inplace=True)

Cleaned Data

In [94]:
data.head()

              location  total_sqft  bath  price  bhk
0  1st Block Jayanagar      2850.0   4.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0  194.0    3
2  1st Block Jayanagar      1875.0   2.0  235.0    3
3  1st Block Jayanagar      2400.0   4.0  450.0    4
4  1st Block Jayanagar      1235.0   2.0  148.0    2

In [96]:
data.to_csv("Cleaned_data.csv")

In [97]:
x=data.drop(columns=['price'])
y=data['price']

In [99]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import  LinearRegression,Lasso,Ridge
from sklearn.preprocessing import  OneHotEncoder,StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [101]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

Applying Linear Regression

In [103]:
column_trans=make_column_transformer((OneHotEncoder(sparse=False),['location']),
                                     remainder='passthrough')

In [104]:
scaler=StandardScaler()

In [105]:
lr=LinearRegression(normalize=True)

In [106]:
pipe=make_pipeline(column_trans,scaler,lr)

In [108]:
pipe.fit(x_train,y_train)

/usr/local/lib/python3.7/dist-packages/sklearn/linear_model/_base.py:145: FutureWarning: 'normalize' was deprecated in version 1.0 and will be removed in 1.2.
If you wish to scale the data, use Pipeline with a StandardScaler in a preprocessing stage. To reproduce the previous behavior:

from sklearn.pipeline import make_pipeline

model = make_pipeline(StandardScaler(with_mean=False), LinearRegression())

If you wish to pass a sample_weight parameter, you need to pass it as a fit parameter to each step of the pipeline as follows:

kwargs = {s[0] + '__sample_weight': sample_weight for s in model.steps}
model.fit(X, y, **kwargs)


  FutureWarning,

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [110]:
y_pred_lr=pipe.predict(x_test)

In [111]:
r2_score(y_test,y_pred_lr)

0.5723788262706478

Applying Lasso

In [112]:
lasso=Lasso()
pipe=make_pipeline(column_trans,scaler,lasso)
pipe.fit(x_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

In [113]:
y_pred_lasso= pipe.predict(x_test)
r2_score(y_test,y_pred_lasso)

0.5784774537455188

Applying Ridge

In [114]:
ridge=Ridge()
pipe=make_pipeline(column_trans,scaler,ridge)
pipe.fit(x_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('ridge', Ridge())])

In [115]:
y_pred_ridge= pipe.predict(x_test)
r2_score(y_test,y_pred_ridge)

0.5723645330001479

In [116]:
import pickle

In [117]:
pickle.dump(pipe,open('model.pkl','wb'))